      ******************* DATECNVC V1.0.0 *****************************
      *****************************************************************
      *                                                               *
      * NAME: DATECNVC - PARM LIST DEFINITIONS FOR DATECNV            *
      *                                                               *
      * NOTE: THERE IS A PL/1 VERSION OF THIS.  THEY SHOULD BE KEPT   *
      *       IN SYNC.                                                *
      *                                                               *
      *****************************************************************
      *                                                               *
      *  (C) COPYRIGHT 2023 EDWARD G LISS   ALL RIGHTS RESERVED       *
      *                                                               *
      *  THIS SOURCE CODE AS WELL AS ANY OBJECT CODE RESULTING FROM   *
      *  THIS SOURCE CODE MAY BE DISTRIBUTED FREELY PROVIDED NO FEE   *
      *  IS CHARGED AND FOR NON-COMERCIAL PURPOSES.                   *
      *                                                               *
      *  FOR COMMERCIAL DISTRIBUTION RIGHTS, CONTACT THE COPYRIGHT    *
      *  OWNER.                                                       *
      *                                                               *
      *****************************************************************
      *                                                               *
      * REVISION HISTORY                                              *
      * ------  ----------------------------------------------------- *
      * V1.1.0  INITIAL VERSION.                                      *
      *                                                               *
      *****************************************************************

       01  DATECNV-PARM.
           05  DC-RETURN-CODE          PIC S9(8) COMP.
           05  DC-INPUT-FORMAT         PIC X(8).
           05  DC-INPUT-DATE           PIC X(10).
           05  DC-OUTPUT-FORMAT        PIC X(8).
           05  DC-OUTPUT-DATE          PIC X(10).
      ******************* DATECNVC V1.0.0  END ************************
